# Задача №1
# Напишите программу, которая принимает на вход цифру, обозначающую день недели, и проверяет, является ли этот день выходным.
# Пример:
# - 6 -> да
# - 7 -> да
# - 1 -> нет

# day = int(input('Enter number of the day: '))
# if day in range(1, 8):
#     if day == 6 or day == 7:
#         print('YES')
#     else:
#         print('NO')
# else:
#     print('wrong number!')
# ////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# Задача №2
# Напишите программу для. проверки истинности утверждения ¬(X ⋁ Y ⋁ Z) = ¬X ⋀ ¬Y ⋀ ¬Z для всех значений предикат.

# for x in range(0, 2):
#     for y in range(0, 2):
#         for z in range(0, 2):
#             print(x, y, z, end=':')
#             print(not (x or y or z) == ((not x) and (not y) and (not z)))
# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////

# Задача №3
# Напишите программу, которая принимает на вход координаты точки(X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка(или на какой оси она находится).
# Пример:
# x = 34; y = -30 -> 4
# x = 2; y = 4 -> 1
# x = -34; y = -30 -> 3

# x = int(input('Enter x : '))
# y = int(input('Enter y : '))
# if x > 0 and y > 0:
#     print('quarter 1')
# elif x < 0 and y > 0:
#     print('quarter 2')
# elif x < 0 and y < 0:
#     print('quarter 3')
# else:
#     print('quarter 4')

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# Задача №4
# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти(x и y).

# q = int(input("quarter number from 1 to 4 : "))
# if q == 1:
#     print('x > 0, y > 0')
# elif q == 2:
#     print('x < 0, y > 0')
# elif q == 3:
#     print('x < 0, y < 0')
# else:
#     print('x > 0, y < 0')

# /////////////////////////////////////////////////////////////////////////////////////////////////////////////////
# Задача №5
# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.
# Пример:
# A(3, 6); B(2, 1) -> 5, 09
# A(7, -5); B(1, -1) -> 7, 21

# x1 = int(input('Enter x1 : '))
# y1 = int(input('Enter y1 : '))
# x2 = int(input('Enter x2 : '))
# y2 = int(input('Enter y2 : '))
# bc = x1 - x2
# ac = y2 - y1
# print(int(((bc ** 2 + ac ** 2) ** 0.5) * 100) / 100)
