# Task 1:
# Задайте список из нескольких чисел. Напишите программу, которая найдёт сумму элементов списка, стоящих на нечётной позиции.
# Пример:
# - [2, 3, 5, 9, 3] -> на нечётных позициях элементы 3 и 9, ответ: 12
# amount = int(input('Enter amount numbers of list : '))
# ls = []
# sum = 0
# for _ in range(amount):
#     number = int(input())
#     ls.append(number)
# for i in range(1, amount, 2):
#     sum += ls[i]
# print(sum)
# **************************************************************************

# Task 2
# Напишите программу, которая найдёт произведение пар чисел списка. Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# Пример:
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

# amount = int(input('Enter amount numbers of list : '))
# ls = []
# n_ls = []
# for _ in range(amount):
#     number = int(input())
#     ls.append(number)
# for ind in range((amount - 1) // 2 + 1):
#     num1 = ls[ind]
#     num2 = ls[amount - ind - 1]
#     n_ls.append(num1 * num2)
# print(n_ls)
# ****************************************************************************
# Task 3
# Задайте список из вещественных чисел. Напишите программу, которая найдёт разницу между максимальным и минимальным значением дробной части элементов.
# Пример:
# - [1.1, 1.2, 3.1, 5, 10.01] => 0.19
# amount = int(input('Enter amount numbers of list : '))
# ls = []

# for _ in range(amount):
#     number = input()
#     ls.append(number)
# max = 0
# min = 1
# for i in ls:
#     if '.' in str(i):
#         dr = str(i).split('.')[1]
#         if float('0.' + dr) > max:
#             max = float('0.' + dr)
#         elif float('0.' + dr) < min:
#             min = float('0.' + dr)
# print(max - min)
# ****************************************************************************

# Task 4
# Напишите программу, которая будет преобразовывать десятичное число в двоичное.
# Пример:
# - 45 -> 101101
# - 3 -> 11
# - 2 -> 10
# a = int(input("Enter number : "))
# b = ''
# while a != 0:
#     b = str(a % 2) + b
#     a //= 2
# print(b)
# ********************************************************************************

# Task 5
# Задайте число. Составьте список чисел Фибоначчи, в том числе для отрицательных индексов.
# Пример:
# - для k = 8 список будет выглядеть так: [-21 ,13, -8, 5, −3, 2, −1, 1, 0, 1, 1, 2, 3, 5, 8, 13, 21
# a = int(input())
# ls = [0] * (a * 2 + 1)
# ls[a + 1] = 1
# for id in range(a + 2, a * 2 + 1):
#     ls[id] = ls[id - 1] + ls[id - 2]
# for id in range(a, -1, -1):
#     ls[id] = ls[id + 2] - ls[id + 1]
# print(ls)
